Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/memn.tmx
Source language: ca
Languages: es_es

source: En un document HTML volem que la frase aquest document siga un enllaç al document que té l'URI |http://www.uc.za/t.html|: quina de les següents porcions de HTML és la correcta?
es_es: En un documento HTML queremos que la frase este documento sea un enlace al documento que tiene el URI |http://www.uc.za/t.html|: ¿cuál de las siguientes porciones de HTML es la correcta?

source: Veiem bé totes les lletres excepte les accentuades, les que porten dièresi, la ñ o la ç: en el seu lloc apareixen les versions sense accent, la n o la c.
es_es: Vemos bien todas las letras excepto las acentuadas, las que traen diéresis, la ñ o la ç : en su lugar aparecen las versiones sin acento, la n o la c .

source: Som a Eslovàquia, on s'usa la codificació de caràcters ISO-8859-2.
es_es: Estamos en Eslovaquia, donde se usa la codificación de caracteres ISO-8859-2.

source: Aquests textos es poden produir i llegir amb qualsevol editor de textos (vegeu l'epígraf ).
es_es: Estos textos se pueden producir y leer con cualquier editor de textos (mirad el epígrafe ).

source: S'ha reorganitzat tota la codificació.
es_es: Se ha reorganizado toda la codificación.

source: <p>Aquest és el <em>primer</em> paràgraf d'aquest document.
es_es: <p>Este es el <em>primer</em> párrafo de este documento.

source: El text ha estat traduït mantenint les convencions de la llengua d'origen: per a fer-lo adequat a la llengua d'arribada, ens toca, d'una banda, anar mirant un a un els segments de text en cursives, decidir si són definicions, i canviar-los a negretes si cal; d'altra banda, ens toca anar llevant el puntet final de tots els números de secció.
es_es: El texto ha sido traducido manteniendo las convenciones de la lengua de origen: para hacerlo adecuado a la lengua de llegada, nos toca, por un lado, ir mirando uno a uno los segmentos de texto en cursivas, decidir si son definiciones, y cambiarlos a negritas si hace falta; por otro lado, nos toca ir quitando el puntito final de todos los números de sección.

source: {}entre 128 i 255.
es_es: {}entre 128 y 255.

source: Com es diuen les combinacions especials de caràcters ASCII de l'estil de ``{ <B>}'' o ``{ </B>}'' que s'usen per a indicar tipus de lletra, grandàries de lletra, formats, etc., en algunes codificacions?
es_es: ¿Cómo se llaman las combinaciones especiales de caracteres ASCII del estilo de ``{ <B>}'' o ``{ </B>}'' que se usan para indicar tipo de letra, tamaños de letra, formados, etc., en algunas codificaciones?

source: Quants octets (bytes) ocupa com a mínim el següent fitxer HTML?
es_es: ¿Cuántos octetos (bytes) ocupa como mínimo el siguiente fichero HTML?

source: Format pròpiament dit
es_es: Formado propiamente dicho

source: El fragment de document HTML ``|<strong><em>link</strong></em>|'' té una errada.
es_es: El fragmento de documento HTML ``|<strong><em>link</strong></em>|'' tiene un error.

source: 4 exactament.
es_es: 4 exactamente.

source: El RAP genera text a partir de la veu recollida a través d'un micròfon utilitzant una targeta de so per a digitalitzar-la i després un sistema de reconeixement automàtic de la veu (automatic speech recognition) per a detectar fonemes, síl·labes o paraules completes (depén del sistema concret) i traduir-les posteriorment a un text informatitzat.
es_es: El RAH genera texto a partir de la voz recogida a través de un micrófono utilizando una tarjeta de sonido para digitalizarla y después un sistema de reconocimiento automático de la voz (automatic speech recognition) para detectar fonemas, sílabas o palabras completas (depende del sistema concreto) y traducirlas posteriormente a un texto informatizado.

source: La línia <!ELEMENT FAX (DESTINATARI, REMITENT?, DATA, TEXT)> defineix l'element arrel o principal, FAX, i especifica que es compon (en l'ordre especificat) d'un DESTINATARI, un REMITENT opcional (indicat amb ?), d'una DATA i d'un TEXT.
es_es: La línea <!ELEMENT FAX (DESTINATARI, REMITENT?, DATA, TEXT)> define el elemento raíz o principal, FAX, y especifica que se compone (en el orden especificado) de un DESTINATARIO, un REMITENTE opcional (indicado con ?), de una FECHA y de un TEXTO.

source: SGML, el llenguatge estàndar generalitzat de marques, havia tingut un èxit relatiu fins a mitjans dels noranta; però l'aparició d'una versió restringida i simplificada de SGML anomenada XML ha impulsat enormement l'adopció dels formats d'estructuració de documents, de tal manera que en l'actualitat s'usa XML moltíssim més que el SGML original; per això, ens centrarem en aquest últim format.
es_es: SGML, el lenguaje estándar generalizado de marcas, había tenido un éxito relativo hasta mediados de los noventa; pero la aparición de una versión restringida y simplificada de SGML llamada XML ha impulsado enormemente la adopción de los formatos de estructuración de documentos, de tal manera que en la actualidad se usa XML muchísimo más que el SGML original; por eso, nos centraremos en este último formato.

source: Heus ací algunes de les operacions bàsiques que es poden fer amb un processador de textos, organitzades de manera similar als menús que trobarem en un processador de text: Operacions amb fitxers: crear un nou document de text; obrir un fitxer de document existent en el disc per a treballar-hi; guardar el document en curs en un fitxer amb el mateix nom i en el mateix format que tenia quan el vam obrir; guardar el document en curs amb un altre nom o en un altre format, per exemple el d'un altre processador de textos ({ guardar com}); imprimir el document actual; fer una presentació preliminar en pantalla del document tal com quedarà imprés (quan el processador no és completament wysiwyg)
es_es: He aquí algunas de las operaciones básicas que se pueden hacer con un procesador de textos, organizadas de manera similar a los menús que encontraremos en un procesador de texto: Operaciones con ficheros: crear un nuevo documento de texto; abrir un fichero de documento existente en el disco para trabajar; guardar el documento en curso en un fichero con el mismo nombre y en el mismo formato que tenía cuando lo abrimos; guardar el documento en curso con otro nombre o en otro formato, por ejemplo el de otro procesador de textos ({ guardar como}); imprimir el documento actual; hacer una presentación preliminar en pantalla del documento tal como quedará imprimido (cuando el procesador no es completamente wysiwyg)

source: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Strict//EN" "http://www.w3.org/TR/html4/strict.dtd"> <html> <head> <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1"> <title>Títol del document</title> </head>
es_es: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Strict//EN" "http://www.w3.org/TR/html4/strict.dtd"> <html> <head> <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1"> <title>Título del documento</title> </head>

source: Com ja s'ha dit, el significat de les etiquetes pot estar associat, per exemple, a la manera (estil, vegeu la p. ) de presentar el document quan s'imprimeix (per exemple, el destinatari del fax pot anar en negretes), però també podria servir per a facilitar el processament de la informació (per exemple, buscar tots els faxos que tenen un determinat destinatari, o, en llibres codificats en XML, decidir quines parts han de ser traduïdes automàticament de l'espanyol a l'anglés i quines no perquè són cites literàries).}).
es_es: Como ya se ha dicho, el significado de las etiquetas puede estar asociado, por ejemplo, a la manera(estilo, mirad la p. ) de presentar el documento cuando se imprime (por ejemplo, el destinatario del fax puede ir en negritas), pero también podría servir para facilitar el procesamiento de la información (por ejemplo, buscar todos los faxes que tienen un determinado destinatario, o, en libros codificados en XML, decidir qué partes tienen que ser traducidas automáticamente del español al inglés y cuáles no porque son citas literarias).}).

source: <!-- Aquest és l'exemple de DTD de FAX --> Les línies següents defineixen l'estructura del document definint els seus elements.
es_es: <!-- Este es un ejemplo de DTD de FAX --> Las líneas siguientes definen la estructura del documento definiendo sus elementos.

source: Més de dos anys.
es_es: Más de dos años.

source: Quan presentem un document visualment, intentem que la representació visual de les diverses parts del document comuniquen l'estructura lògica del contingut a la persona lectora, però, com presentem l'estructura lògica d'un document a una persona cega?
es_es: Cuando presentamos un documento visualmente, intentamos que la representación visual de las diversas partes del documento comuniquen la estructura lógica del contenido a la persona lectora, pero, ¿cómo presentamos la estructura lógica de un documento a una persona ciega?

source: Quan estem mirant un document HTML amb un navegador, podem veure les etiquetes HTML que el formaten si seleccionem l'opció ``veure font HTML'' (``view HTML source'') o similar que hi ha normalment en el menú ``veure'' (``view'').
es_es: Cuando estamos mirando un documento HTML con un navegador, podemos ver las etiquetas HTML que lo formatean si seleccionamos la opción ``ver fuente HTML'' (``view HTML source'') o similar que hay normalmente en el menú ``ver'' (``view'').

source: El RAP de propòsit general està encara molt lluny de ser perfecte, i, de fet, és encara un camp de recerca actiu.
es_es: El RAH de propósito general está todavía muy lejos de ser perfecto, y, de hecho, es todavía un campo de investigación activo.

source: De tota manera, encara hi ha formats molt importants que es basen en SGML, com el llenguatge de marques per a hipertextos HTML, encara que les revisions més recents de HTML ---conegudes com XHTML--- es basen directament en XML.
es_es: De todas maneras, todavía hay formatos muy importantes que se basan en SGML, como el lenguaje de marcas para hipertextos HTML, aunque las revisiones más recientes de HTML ---conocidas como XHTML--- se basan directamente en XML.

source: El RATE genera un text informatitzat a partir d'un document imprés, usant un escàner (o scanner) i un programa de reconeixement òptic (tam­bé se'n diu { automàtic}) de caràcters (OCR, optical character recognition).
es_es: Lo RATE genera un texto informatizado a partir de un documento impreso, usando un escáner (o scanner ) y un programa de reconocimiento óptico (también se le llama { automático}) de caracteres (OCR, optical character recognition).

source: La longitud mitjana d'un mot en gondavés és de 5,5 caràcters i l'edició electrònica de Gundhawól Vlâj (``La Veu de Gondàvia''), té uns 100.000 mots diaris com a mitjana.
es_es: La longitud mediana de una palabra en gondavés es de 5,5 caracteres y la edición electrónica de Gundhawól Vlâj (``La Voz de Gondàvia''), tiene unas 100.000 palabras diarias como media.

source: Què indica el fragment (
es_es: Qué indica el fragmento (

source: El fet que hi haja més d'una manera estàndard d'usar els nous codis fa que de vegades els textos amb caràcters especials no queden bé quan passem d'un processador de textos (o un editor de textos) a un altre (els caràcters d'ASCII es veuen normalment bé: els que fallen són els nous).
es_es: El hecho de que haya más de una manera estándar de usar los nuevos códigos hace que a veces los textos con caracteres especiales no queden bien cuando pasamos de un procesador de textos (o un editor de textos) a otro (los caracteres de ASCII se ven normalmente bien: los que fallan son los nuevos).

source: En la codificació ANSI ISO-8859-1, tots els caràcters accentuats de l'espanyol o del català tenen codis{}
es_es: En la codificación ANSI ISO-8859-1, todos los caracteres acentuados del español o del catalán tienen códigos{}

source: Definit en {http://www.w3.org/TR/xhtml1/
es_es: Definido en {http://www.w3.org/tr/xhtml1/

source: Quan les marques de format només especifiquen el contingut d'un document (identificant les parts i l'estructura de cada una), com s'assigna una presentació determinada al document?
es_es: Cuando las marcas de formato sólo especifican el contenido de un documento (identificando las partes y la estructura de cada una), ¿cómo se asigna una presentación determinada al documento?

source: Imaginem una al·locució (un segment de veu humana) en espanyol que pot tenir (entre d'altres) les interpretacions ``millones de oros'' i ``millones de euros''.
es_es: Imaginemos una alocución (un segmento de voz humana) en español que puede tener (entre otros) las interpretaciones ``millones de oros'' y ``millones de euros''.

source: Vladimir no pot anar a esmorzar: ha de canviar els números de seccions i subseccions a partir de la 5 i repassar si s'ha de canviar alguna referència que es faça des d'una part del text a una secció pel seu número.
es_es: Vladimir no puede ir a almorzar: tiene que cambiar los números de secciones y subseccions a partir de la 5 y repasar si se tiene que cambiar alguna referencia que se haga desde una parte del texto a una sección por su número.

source: Depén de com siga d'estricte el programa validador No, perquè aquesta situació no és vàlida.
es_es: Depende de cómo sea de estricto el programa validador No, porque esta situación no es válida.

source: Quin és el joc de caràcters que usa el document XML.
es_es: Cuál es el juego de caracteres que usa el documento XML.

source: Un text ANSI ISO-8859-1 té 1000 caràcters justos (comptant els espais en blanc i els salts de línia).
es_es: Un texto ANSI ISO-8859-1 tiene 1000 caracteres justos (contando los espacios en blanco y los saltos de línea).

source: Aquest és el primer paràgraf d'aquest document.
es_es: Este es el primer párrafo de este documento.

source: Per exemple, l'ordre CSS h2 { display : block ; font-size : large ; font-family : sans-serif ; text-align : left ; margin-top: 0.2cm ; margin-bottom : 0.2cm ; } indica que tots els encapçalaments de segon nivell (h2) de HTML es visualitzen (display) com a blocs de text separat (block), amb una grandària de lletra (font-size) gran (large) de la família sans serif, alineat (text-align) a l'esquerra, i amb màrgens superior i inferior de 0,2 cm.
es_es: Por ejemplo, la orden CSS h2 { display : block ; font-size : large ; font-family : sans-serif ; texto-align : left ; margin-top: 0.2cm ; margin-bottom : 0.2cm ; } indica que todos los encabezamientos de segundo nivel (h2) de HTML se visualizan (display) como bloques de texto separado (block), con un tamaño de letra (fuente-size) grande (large) de la familia sans serif, alineado (texto-align) a la izquierda, y con márgenes superior e inferior de 0,2 cm.

source: Usant estadístiques de aparició conjunta de paraules en espanyol.
es_es: Usando estadísticas de aparición conjunta de palabras en español.

source: NL (nova línia)
es_es: NL (nueva línea)

source: Per exemple, un document XML corresponent a un FAX podria tenir l'aparença que es mostra en la figura .
es_es: Por ejemplo, un documento XML correspondiendo a un FAX podría tener la apariencia que se muestra en la figura .

source: Quant a l'aparença del programa, la major part dels processadors de text es manifesten bàsicament com una o diverses finestres, cada una de les quals mostra una secció d'algun dels documents de text informatitzats que estem creant i modificant (els documents que tenim oberts).
es_es: En cuanto a la apariencia del programa, la mayor parte de los procesadores de texto se manifiestan básicamente como una o varias ventanas, cada una de las cuales muestra una sección de alguno de los documentos de texto informatizados que estamos creando y modificando (los documentos que tenemos abiertos).

source: No s'ha indicat el valor de l'atribut |href| de l'element |em|.
es_es: No se ha indicado el valor del atributo |href| del elemento |me|.

source: Per exemple, podem fer que la presentació visual del FAX de la figura tinga un encapçalament amb el mot FAX amb aquesta ordre CSS (amb comentaris entre /* i */): FAX:before { /* Abans del FAX */ content : "FAX" ; /* El mot FAX */ display : block ; /* com un bloc */ font-weight : bold ; /* en negreta */ text-align : center ; /* centrat */ font-size : x-large ; /* i amb lletra extra-gran */ }
es_es: Por ejemplo, podemos hacer que la presentación visual del FAX de la figura tenga un encabezamiento con la palabra FAX con esta orden CSS (con comentarios entre / y / ): FAX:before { /* Antes del FAX / content : "FAX" ; /* La palabra FAX / display : block ; /* como un bloque / font-weight : bold ; /* en negrita / text-align : center ; /* centrado / font-size : x-large ; /* y con letra extra-grande / }

source: Què és RTF?
es_es: ¿Qué es RTF?

source: {Accessibilitat} En quasi tota la discussió anterior hem parlat de presentació referint-nos sempre a un mitjà visual, de manera que hem exclòs, per exemple, les persones que tenen discapacitats o limitacions relacionades amb el sentit de la vista (poden no veure gens o veure molt malament, o patir atacs epilèptics quan veuen una imatge que canvia ràpidament de color).
es_es: {Accesibilidad} En casi toda la discusión anterior hemos hablado de presentación refiriéndonos siempre a un medio visual, de forma que hemos excluido, por ejemplo, las personas que tienen discapacidades o limitaciones relacionadas con el sentido de la vista (pueden no ver nada o ver muy mal, o sufrir ataques epilépticos cuando ven una imagen que cambia rápidamente de color).

source: L'ordre de les marques d'obertura i clausura no és correcte.
es_es: El orden de las marcas de apertura y clausura no es correcto.

source: |<link url="http://www.uc.za/t.html">aquest document</link>|
es_es: |<link url="http://www.uc.za/t.html">este documento</link>|

source: La primera línia declara que el document és un document XML de la versió 1.0 i que el joc de caràcters que usa és l'ISO-8859-1 (o ``Latin 1'').
es_es: La primera línea declara que el documento es un documento XML de la versión 1.0 y que el juego de caracteres que usa es la ISO-8859-1 (o ``Latin 1'').

source: Ens han encarregat traduir un text informatitzat.
es_es: Nos han encargado traducir un texto informatizado.

source: {Alguns exemples d'ISO-8859-1.
es_es: {Algunos ejemplos de ISO-8859-1.

source: La majoria dels processadors de textos actuals són wysiwyg en el sentit explicat més amunt: el text que s'edita es presenta gràficament en la finestra pràcticament igual com es veurà en el paper quan l'enviem a la impressora; això ha facilitat enormement l'accés de tothom als processadors de textos.
es_es: La mayoría de los procesadores de textos actuales son wysiwyg en el sentido explicado más arriba: el texto que se edita se presenta gráficamente en la ventana prácticamente igual como se verá en el papel cuando lo enviamos a la impresora; esto ha facilitado enormemente el acceso de todo el mundo a los procesadores de textos.

source: De fet, l'ús dels processadors de text s'aprén molt millor en el laboratori; a més, en vista del fet que els processadors de textos canvien constantment, potser és millor no aprendre a usar un processador concret sinó a buscar en cada processador les eines que necessitem.
es_es: De hecho, el uso de los procesadores de texto se aprende mucho mejor en el laboratorio; además, en vista del hecho de que los procesadores de textos cambian constantemente, quizás es mejor no aprender a usar un procesador concreto sino a buscar en cada procesador las herramientas que necesitamos.

source: La separació de l'estructuració del contingut, d'una banda, i dels mecanismes de presentació del document, d'una altra banda, facilita l'accessibilitat al document a través de diversos mitjans a persones discapacitades o en situacions especials.
es_es: La separación de la estructuración del contenido, por un lado, y de los mecanismos de presentación del documento, por otro lado, facilita la accesibilidad al documento a través de varios medios a personas discapacitadas o en situaciones especiales.

source: Què passa?
es_es: ¿Qué pasa?

source: A l'endemà, de matí, Marina, la directora, li passa un document amb una secció més que s'ha d'inserir entre la 4 i la 5.
es_es: Al día siguiente, por la mañana, Marina, la directora, le pasa un documento con una sección más que se tiene que insertar entre la 4 y la 5.

source: Aquesta és la denominació usada per Word i pel processador gratuït de codi obert OpenOffice.org
es_es: Esta es la denominación usada por Word y por el procesador gratuito de código abierto Openoffice.org

source: Operacions de cerca i substitució: buscar una determinada paraula o seqüència de caràcters en el text; repetir l'última recerca; buscar una determinada paraula o seqüència de caràcters en el text i substituir-la per una altra (interactivament o automàticament).
es_es: Operaciones de búsqueda y sustitución: buscar una determinada palabra o secuencia de caracteres en el texto; repetir la última investigación; buscar una determinada palabra o secuencia de caracteres en el texto y sustituirla por otra (interactivamente o automáticamente).

source: En un sistema de reconeixement automàtic dels textos escrits, si un mot és reconegut com a un d'aquests quatre: |eorren|, |eorrcn|, |corren| o |corrcn|, quina és la millor estratègia per a triar-ne una sense usar un diccionari de català (o d'espanyol)?
es_es: En un sistema de reconocimiento automático de los textos escritos, si una palabra es reconocida como uno de estos cuatro: |eorren|, |eorrcn|, |corren| o |corrcn|, ¿cuál es la mejor estrategia para elegir una sin usar un diccionario de catalán (o de español)?

source: En l'exemple, es pot veure que un fax (<FAX></FAX>) té un destinatari, un remitent, una data i un text; és a dir, els elements poden contenir altres elements; les marques funcionen com a parèntesis.
es_es: En el ejemplo, se puede ver que un fax (<FAX></FAX>) tiene un destinatario, un remitente, una fecha y un texto; es decir, los elementos pueden contener otros elementos; las marcas funcionan como paréntesis.

source: Els fulls d'estil es poden usar també per a visualitzar documents XML directament en els navegadors més recents.
es_es: Las hojas de estilo se pueden usar también para visualizar documentos XML directamente en los navegadores más recientes.

source: Necessitem codificar-hi informació estructural (sobre l'organització del contingut del document) o presentacional (sobre l'aparença que tindrà quan es presente): tipus i grandàries de lletra, format dels paràgrafs, notes a peu de pàgina, etc.
es_es: Necesitemos codificar información estructural (sobre la organización del contenido del documento) o presentacional (sobre la apariencia que tendrá cuando se presente): tipo y tamaños de letra, formado de los párrafos, notas a pie de página, etc.

source: Els navegadors més recents ja són capaços d'aplicar fulls d'estil XSL a pàgines web escrites en XML i presentar-les com si estigueren escrites originalment en HTML.
es_es: Los navegadores más recientes ya son capaces de aplicar hojas de estilo XSL a páginas web escritas en XML y presentarlas cómo si estuvieran escritas originalmente en HTML.

source: Un document XML és un document de text on, a més del text pròpiament dit, podem trobar etiquetes o marques (en anglés tags) que donen informació sobre la naturalesa i l'organització de cada un dels continguts del document; com ja s'ha dit, un document XML és un document estructurat.
es_es: Un documento XML es un documento de texto donde, además del texto propiamente dicho, podemos encontrar etiquetas o marcas (en inglés tags) que dan información sobre la naturaleza y la organización de cada uno de los contenidos del documento; como ya se ha dicho, un documento XML es un documento estructurado.
